#pragma once

// Mirror's Edge (1.0) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x1)
#endif

namespace Classes
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class Engine.AnimNode
// 0x0080 (0x00BC - 0x003C)
class UAnimNode : public UObject
{
public:
	struct FName                                       ClassName;                                                // 0x003C(0x0008) (Edit, EditConst)
	class USkeletalMeshComponent*                      SkelComponent;                                            // 0x0044(0x0004) (ExportObject, Transient, Component, EditInline)
	TArray<class UAnimNodeBlendBase*>                  ParentNodes;                                              // 0x0048(0x000C) (Transient, NeedCtorLink)
	struct FName                                       NodeName;                                                 // 0x0054(0x0008) (Edit)
	TArray<struct FBoneAtom>                           CachedBoneAtoms;                                          // 0x005C(0x000C) (Transient, NeedCtorLink)
	struct FBoneAtom                                   CachedRootMotionDelta;                                    // 0x0068(0x0020) (Transient)
	int                                                bCachedHasRootMotion;                                     // 0x0088(0x0004) (Transient)
	unsigned long                                      bRelevant : 1;                                            // 0x008C(0x0004) (Const, Transient)
	unsigned long                                      bJustBecameRelevant : 1;                                  // 0x008C(0x0004) (Const, Transient)
	unsigned long                                      bSkipTickWhenZeroWeight : 1;                              // 0x008C(0x0004) (Edit)
	unsigned long                                      bTickDuringPausedAnims : 1;                               // 0x008C(0x0004) (Edit)
	int                                                NodeTickTag;                                              // 0x0090(0x0004) (Const, Transient)
	int                                                NodeCachedAtomsTag;                                       // 0x0094(0x0004) (Const, Transient)
	float                                              NodeTotalWeight;                                          // 0x0098(0x0004) (Const)
	float                                              TotalWeightAccumulator;                                   // 0x009C(0x0004) (Const, Transient)
	int                                                DrawWidth;                                                // 0x00A0(0x0004)
	int                                                DrawHeight;                                               // 0x00A4(0x0004)
	int                                                NodePosX;                                                 // 0x00A8(0x0004)
	int                                                NodePosY;                                                 // 0x00AC(0x0004)
	int                                                OutDrawY;                                                 // 0x00B0(0x0004)
	int                                                InstanceVersionNumber;                                    // 0x00B4(0x0004) (Const)
	int                                                SearchTag;                                                // 0x00B8(0x0004) (Const, Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.AnimNode");
		return ptr;
	}


	void StopAnim();
	void PlayAnim(bool bLoop, float Rate, float StartTime);
	class UAnimNode* FindAnimNode(const struct FName& InNodeName);
	void EditorProfileUpdated(const struct FName& ProfileName);
	void OnCeaseRelevant();
	void OnBecomeRelevant();
	void OnInit();
};


// Class Engine.Actor
// 0x0184 (0x01C0 - 0x003C)
class AActor : public UObject
{
public:
	unsigned long                                      bExludeHandMoves : 1;                                     // 0x003C(0x0004) (Edit)
	unsigned long                                      bExludeFootMoves : 1;                                     // 0x003C(0x0004) (Edit)
	unsigned long                                      bPhysXMutatable : 1;                                      // 0x003C(0x0004) (Edit)
	unsigned long                                      bStatic : 1;                                              // 0x003C(0x0004) (Const)
	unsigned long                                      bHidden : 1;                                              // 0x003C(0x0004) (Edit, Const, Net)
	unsigned long                                      bNoDelete : 1;                                            // 0x003C(0x0004) (Const)
	unsigned long                                      bDeleteMe : 1;                                            // 0x003C(0x0004) (Const)
	unsigned long                                      bTicked : 1;                                              // 0x003C(0x0004) (Const, Transient)
	unsigned long                                      bOnlyOwnerSee : 1;                                        // 0x003C(0x0004) (Const)
	unsigned long                                      bStasis : 1;                                              // 0x003C(0x0004)
	unsigned long                                      bWorldGeometry : 1;                                       // 0x003C(0x0004)
	unsigned long                                      bIgnoreRigidBodyPawns : 1;                                // 0x003C(0x0004)
	unsigned long                                      bOrientOnSlope : 1;                                       // 0x003C(0x0004)
	unsigned long                                      bIgnoreEncroachers : 1;                                   // 0x003C(0x0004) (Const)
	unsigned long                                      bPushedByEncroachers : 1;                                 // 0x003C(0x0004)
	unsigned long                                      bDestroyedByInterpActor : 1;                              // 0x003C(0x0004)
	unsigned long                                      bRouteBeginPlayEvenIfStatic : 1;                          // 0x003C(0x0004) (Const)
	unsigned long                                      bIsMoving : 1;                                            // 0x003C(0x0004) (Const)
	unsigned long                                      bAlwaysEncroachCheck : 1;                                 // 0x003C(0x0004)
	unsigned long                                      bHasAlternateTargetLocation : 1;                          // 0x003C(0x0004)
	unsigned long                                      bNetTemporary : 1;                                        // 0x003C(0x0004) (Const)
	unsigned long                                      bOnlyRelevantToOwner : 1;                                 // 0x003C(0x0004) (Const)
	unsigned long                                      bNetDirty : 1;                                            // 0x003C(0x0004) (Transient)
	unsigned long                                      bAlwaysRelevant : 1;                                      // 0x003C(0x0004)
	unsigned long                                      bReplicateInstigator : 1;                                 // 0x003C(0x0004)
	unsigned long                                      bReplicateMovement : 1;                                   // 0x003C(0x0004)
	unsigned long                                      bSkipActorPropertyReplication : 1;                        // 0x003C(0x0004)
	unsigned long                                      bUpdateSimulatedPosition : 1;                             // 0x003C(0x0004)
	unsigned long                                      bTearOff : 1;                                             // 0x003C(0x0004) (Net)
	unsigned long                                      bOnlyDirtyReplication : 1;                                // 0x003C(0x0004)
	unsigned long                                      bDemoRecording : 1;                                       // 0x003C(0x0004) (Transient)
	unsigned long                                      bDemoOwner : 1;                                           // 0x003C(0x0004)
	unsigned long                                      bForceDemoRelevant : 1;                                   // 0x0040(0x0004)
	unsigned long                                      bNetInitialRotation : 1;                                  // 0x0040(0x0004) (Const)
	unsigned long                                      bReplicateRigidBodyLocation : 1;                          // 0x0040(0x0004)
	unsigned long                                      bKillDuringLevelTransition : 1;                           // 0x0040(0x0004)
	unsigned long                                      bExchangedRoles : 1;                                      // 0x0040(0x0004) (Const)
	unsigned long                                      bConsiderAllStaticMeshComponentsForStreaming : 1;         // 0x0040(0x0004) (Edit)
	unsigned long                                      bIgnoreForAITraces : 1;                                   // 0x0040(0x0004) (Edit)
	unsigned long                                      bInteractable : 1;                                        // 0x0040(0x0004) (Edit)
	unsigned long                                      bLOIObject : 1;                                           // 0x0040(0x0004) (Edit, Const)
	unsigned long                                      bDebug : 1;                                               // 0x0040(0x0004) (Edit)
	unsigned long                                      bPostRenderIfNotVisible : 1;                              // 0x0040(0x0004)
	unsigned long                                      bForceNetUpdate : 1;                                      // 0x0040(0x0004) (Transient)
	unsigned long                                      bPendingNetUpdate : 1;                                    // 0x0040(0x0004) (Const, Transient)
	unsigned long                                      bHardAttach : 1;                                          // 0x0040(0x0004) (Edit, Const, Net)
	unsigned long                                      bIgnoreBaseRotation : 1;                                  // 0x0040(0x0004) (Edit)
	unsigned long                                      bShadowParented : 1;                                      // 0x0040(0x0004) (Edit)
	unsigned long                                      bCanBeAdheredTo : 1;                                      // 0x0040(0x0004)
	unsigned long                                      bCanBeFrictionedTo : 1;                                   // 0x0040(0x0004)
	unsigned long                                      bHurtEntry : 1;                                           // 0x0040(0x0004)
	unsigned long                                      bGameRelevant : 1;                                        // 0x0040(0x0004)
	unsigned long                                      bMovable : 1;                                             // 0x0040(0x0004) (Const)
	unsigned long                                      bDestroyInPainVolume : 1;                                 // 0x0040(0x0004)
	unsigned long                                      bCanBeDamaged : 1;                                        // 0x0040(0x0004)
	unsigned long                                      bShouldBaseAtStartup : 1;                                 // 0x0040(0x0004)
	unsigned long                                      bPendingDelete : 1;                                       // 0x0040(0x0004)
	unsigned long                                      bCanTeleport : 1;                                         // 0x0040(0x0004)
	unsigned long                                      bAlwaysTick : 1;                                          // 0x0040(0x0004) (Const)
	unsigned long                                      bBlocksNavigation : 1;                                    // 0x0040(0x0004) (Edit)
	unsigned long                                      BlockRigidBody : 1;                                       // 0x0040(0x0004) (Edit, Const, Transient)
	unsigned long                                      bCollideWhenPlacing : 1;                                  // 0x0040(0x0004)
	unsigned long                                      bCollideActors : 1;                                       // 0x0040(0x0004) (Const, Net)
	unsigned long                                      bCollideWorld : 1;                                        // 0x0040(0x0004) (Net)
	unsigned long                                      bCollideComplex : 1;                                      // 0x0044(0x0004) (Edit)
	unsigned long                                      bBlockActors : 1;                                         // 0x0044(0x0004) (Net)
	unsigned long                                      bProjTarget : 1;                                          // 0x0044(0x0004) (Net)
	unsigned long                                      bBlocksTeleport : 1;                                      // 0x0044(0x0004)
	unsigned long                                      bNoEncroachCheck : 1;                                     // 0x0044(0x0004) (Edit)
	unsigned long                                      bPhysRigidBodyOutOfWorldCheck : 1;                        // 0x0044(0x0004) (Edit)
	unsigned long                                      bComponentOutsideWorld : 1;                               // 0x0044(0x0004) (Const)
	unsigned long                                      bBounce : 1;                                              // 0x0044(0x0004)
	unsigned long                                      bJustTeleported : 1;                                      // 0x0044(0x0004) (Const)
	unsigned long                                      bNetInitial : 1;                                          // 0x0044(0x0004) (Const)
	unsigned long                                      bNetOwner : 1;                                            // 0x0044(0x0004) (Const, Net)
	unsigned long                                      bHiddenEd : 1;                                            // 0x0044(0x0004) (Edit, Const)
	unsigned long                                      bHiddenEdGroup : 1;                                       // 0x0044(0x0004) (Edit, Const)
	unsigned long                                      bHiddenEdCustom : 1;                                      // 0x0044(0x0004) (Const)
	unsigned long                                      bEdShouldSnap : 1;                                        // 0x0044(0x0004) (Edit)
	unsigned long                                      bTempEditor : 1;                                          // 0x0044(0x0004) (Const, Transient)
	unsigned long                                      bPathColliding : 1;                                       // 0x0044(0x0004) (Edit)
	unsigned long                                      bPathTemp : 1;                                            // 0x0044(0x0004) (Transient)
	unsigned long                                      bScriptInitialized : 1;                                   // 0x0044(0x0004)
	unsigned long                                      bLockLocation : 1;                                        // 0x0044(0x0004) (Edit)
	TArray<class UActorComponent*>                     Components;                                               // 0x0048(0x000C) (Const, ExportObject, Component, NeedCtorLink, EditInline)
	TArray<class UActorComponent*>                     AllComponents;                                            // 0x0054(0x000C) (Const, ExportObject, Transient, Component, NeedCtorLink, EditInline)
	struct FRenderCommandFence                         DetachFence;                                              // 0x0060(0x0004) (Const, Native)
	float                                              CustomTimeDilation;                                       // 0x0064(0x0004)
	TEnumAsByte<EPhysics>                              Physics;                                                  // 0x0068(0x0001) (Edit, Const, Net)
	TEnumAsByte<ENetRole>                              RemoteRole;                                               // 0x0069(0x0001) (Net)
	TEnumAsByte<ENetRole>                              Role;                                                     // 0x006A(0x0001) (Net)
	TEnumAsByte<ECollisionType>                        CollisionType;                                            // 0x006B(0x0001) (Edit, Const, Transient)
	TEnumAsByte<ETickingGroup>                         TickGroup;                                                // 0x006C(0x0001) (Const)
	unsigned char                                      UnknownData00[0x3];                                       // 0x006D(0x0003) MISSED OFFSET
	class AActor*                                      Owner;                                                    // 0x0070(0x0004) (Const, Net)
	class AActor*                                      Base;                                                     // 0x0074(0x0004) (Edit, Const, Net)
	TArray<struct FTimerData>                          Timers;                                                   // 0x0078(0x000C) (Const, NeedCtorLink)
	int                                                NetTag;                                                   // 0x0084(0x0004) (Const, Transient)
	float                                              NetUpdateTime;                                            // 0x0088(0x0004) (Const)
	float                                              NetUpdateFrequency;                                       // 0x008C(0x0004)
	float                                              NetPriority;                                              // 0x0090(0x0004)
	float                                              LastNetUpdateTime;                                        // 0x0094(0x0004) (Const, Transient)
	class APawn*                                       Instigator;                                               // 0x0098(0x0004) (Net)
	class AWorldInfo*                                  WorldInfo;                                                // 0x009C(0x0004) (Const, Transient)
	float                                              LifeSpan;                                                 // 0x00A0(0x0004)
	float                                              CreationTime;                                             // 0x00A4(0x0004) (Const)
	float                                              LastRenderTime;                                           // 0x00A8(0x0004) (Transient)
	struct FName                                       Tag;                                                      // 0x00AC(0x0008) (Edit)
	struct FName                                       InitialState;                                             // 0x00B4(0x0008)
	struct FName                                       Group;                                                    // 0x00BC(0x0008) (Edit)
	TArray<class AActor*>                              Touching;                                                 // 0x00C4(0x000C) (Const, Transient, NeedCtorLink)
	TArray<class AActor*>                              Children;                                                 // 0x00D0(0x000C) (Const, Transient, NeedCtorLink)
	float                                              LatentFloat;                                              // 0x00DC(0x0004) (Const)
	class UAnimNodeSequence*                           LatentSeqNode;                                            // 0x00E0(0x0004) (Const)
	class APhysicsVolume*                              PhysicsVolume;                                            // 0x00E4(0x0004) (Const, Transient)
	struct FVector                                     Location;                                                 // 0x00E8(0x000C) (Edit, Const, Net)
	struct FRotator                                    Rotation;                                                 // 0x00F4(0x000C) (Edit, Const, Net)
	struct FVector                                     Velocity;                                                 // 0x0100(0x000C) (Net)
	struct FVector                                     Acceleration;                                             // 0x010C(0x000C)
	struct FVector                                     AngularVelocity;                                          // 0x0118(0x000C) (Const, Transient)
	class USkeletalMeshComponent*                      BaseSkelComponent;                                        // 0x0124(0x0004) (Edit, ExportObject, Component, EditInline)
	struct FName                                       BaseBoneName;                                             // 0x0128(0x0008) (Edit)
	TArray<class AActor*>                              Attached;                                                 // 0x0130(0x000C) (Const, NeedCtorLink)
	struct FVector                                     RelativeLocation;                                         // 0x013C(0x000C) (Const, Net)
	struct FRotator                                    RelativeRotation;                                         // 0x0148(0x000C) (Const, Net)
	float                                              DrawScale;                                                // 0x0154(0x0004) (Edit, Const, Net)
	struct FVector                                     DrawScale3D;                                              // 0x0158(0x000C) (Edit, Const)
	struct FVector                                     PrePivot;                                                 // 0x0164(0x000C) (Edit, Const)
	class UPrimitiveComponent*                         CollisionComponent;                                       // 0x0170(0x0004) (Edit, ExportObject, Component, EditInline)
	int                                                OverlapTag;                                               // 0x0174(0x0004) (Native)
	struct FRotator                                    RotationRate;                                             // 0x0178(0x000C) (Edit)
	struct FRotator                                    DesiredRotation;                                          // 0x0184(0x000C) (Edit)
	class AActor*                                      PendingTouch;                                             // 0x0190(0x0004)
	float                                              MinDistForNetRBCorrection;                                // 0x0194(0x0004) (Edit)
	class UClass*                                      MessageClass;                                             // 0x0198(0x0004)
	TArray<class UClass*>                              SupportedEvents;                                          // 0x019C(0x000C) (Const, NeedCtorLink)
	TArray<class USequenceEvent*>                      GeneratedEvents;                                          // 0x01A8(0x000C) (Const, NeedCtorLink)
	TArray<class USeqAct_Latent*>                      LatentActions;                                            // 0x01B4(0x000C) (NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.Actor");
		return ptr;
	}


	void OnActivateLOI(class USeqAct_ActivateLOI* Sender);
	void OnDeactivateLOI(class USeqAct_DeactivateLOI* Sender);
	void ActivateLOI();
	void AssignPlayerToLOI(class AActor* Player);
	void InitLOI();
	struct FGuid STATIC_GetPackageGuid(const struct FName& PackageName);
	void PostInitAnimTree(class USkeletalMeshComponent* SkelComp);
	void RootMotionExtracted(class USkeletalMeshComponent* SkelComp, struct FBoneAtom* ExtractedRootMotionDelta);
	void RootMotionModeChanged(class USkeletalMeshComponent* SkelComp);
	void PostRenderFor(class APlayerController* PC, class UCanvas* Canvas, const struct FVector& CameraPosition, const struct FVector& CameraDir);
	void NativePostRenderFor(class APlayerController* PC, class UCanvas* Canvas, const struct FVector& CameraPosition, const struct FVector& CameraDir);
	void SetHUDLocation(const struct FVector& NewHUDLocation);
	void OnRanOver(class ASVehicle* Vehicle, class UPrimitiveComponent* RunOverComponent, int WheelIndex);
	void RigidBodyCollision(class UPrimitiveComponent* HitComponent, class UPrimitiveComponent* OtherComponent, int ContactIndex, struct FCollisionImpactData* RigidCollisionData);
	void InterpolationChanged(class USeqAct_Interp* InterpAction);
	void InterpolationFinished(class USeqAct_Interp* InterpAction);
	void InterpolationStarted(class USeqAct_Interp* InterpAction);
	void PickedUpBy(class APawn* P);
	void SpawnedByKismet();
	struct FVector GetTargetLocation(class AActor* RequestedBy, bool bRequestAlternateLoc);
	void FindGoodEndView(class APlayerController* PC, struct FRotator* GoodRotation);
	void NotifyLocalPlayerTeamReceived();
	struct FString GetLocationStringFor(class APlayerReplicationInfo* PRI);
	unsigned char ScriptGetTeamNum();
	unsigned char GetTeamNum();
	void PawnBaseDied();
	bool IsPlayerOwned();
	void GetActorEyesViewPoint(struct FVector* out_Location, struct FRotator* out_Rotation);
	bool IsStationary();
	class UFaceFXAsset* GetActorFaceFXAsset();
	bool IsActorPlayingFaceFXAnim();
	void SetSkelControlScale(const struct FName& SkelControlName, float Scale);
	void SetMorphWeight(const struct FName& MorphNodeName, float MorphWeight);
	void StopActorFaceFXAnim();
	bool PlayActorFaceFXAnim(class UFaceFXAnimSet* AnimSet, const struct FString& GroupName, const struct FString& SeqName);
	void FinishAnimControl();
	void SetAnimWeights(TArray<struct FAnimSlotInfo> SlotInfos);
	void SetAnimPosition(const struct FName& SlotName, int ChannelIndex, const struct FName& InAnimSeqName, float InPosition, bool bFireNotifies, bool bLooping);
	void BeginAnimControl(TArray<class UAnimSet*> InAnimSets);
	void OnAnimPlay(class UAnimNodeSequence* SeqNode);
	void OnAnimEnd(class UAnimNodeSequence* SeqNode, float PlayedTime, float ExcessTime);
	void OnMakeNoise(class USeqAct_MakeNoise* Action);
	void DoKismetAttachment(class AActor* Attachment, class USeqAct_AttachToActor* Action);
	void OnAttachToActor(class USeqAct_AttachToActor* Action);
	void OnToggleHidden(class USeqAct_ToggleHidden* Action);
	void OnChangeCollision(class USeqAct_ChangeCollision* Action);
	void OnSetPhysics(class USeqAct_SetPhysics* Action);
	void OnSetBlockRigidBody(class USeqAct_SetBlockRigidBody* Action);
	void OnTeleport(class USeqAct_Teleport* Action);
	void OnHealDamage(class USeqAct_HealDamage* Action);
	void OnCauseDamage(class USeqAct_CauseDamage* Action);
	void ShutDown();
	void SetNetUpdateTime(float NewUpdateTime);
	void ForceNetRelevant();
	void OnDestroy(class USeqAct_Destroy* Action);
	void ClearLatentAction(class UClass* actionClass, bool bAborted, class USeqAct_Latent* exceptionAction);
	bool FindEventsOfClass(class UClass* EventClass, bool bIncludeDisabled, TArray<class USequenceEvent*>* out_EventList);
	bool ActivateEventClass(class UClass* InClass, class AActor* InInstigator, bool bTest, TArray<class USequenceEvent*>* EventList, TArray<int>* ActivateIndices, TArray<class USequenceEvent*>* ActivatedEvents);
	bool TriggerEventClass(class UClass* InEventClass, class AActor* InInstigator, int ActivateIndex, bool bTest, TArray<class USequenceEvent*>* ActivatedEvents);
	float TimeSince(float Time);
	bool EffectIsRelevant(const struct FVector& SpawnLocation, bool bForceDedicated, float CullDistance);
	bool CheckMaxEffectDistance(class APlayerController* P, const struct FVector& SpawnLocation, float CullDistance);
	bool CanSplash();
	void PlayTeleportEffect(bool bOut, bool bSound);
	bool IsInPain();
	bool IsInVolume(class AVolume* aVolume);
	void Reset();
	class UAudioComponent* GetFaceFXAudioComponent();
	void ModifyHearSoundComponent(class UAudioComponent* AC);
	struct FString GetPhysicsName();
	void DisplayDebug(class AHUD* HUD, float* out_YL, float* out_YPos);
	struct FString GetDebugName();
	void SetGRI(class AGameReplicationInfo* GRI);
	void MatchStarting();
	struct FString STATIC_GetLocalString(int Switch, class APlayerReplicationInfo* RelatedPRI_2, class APlayerReplicationInfo* RelatedPRI_3);
	void STATIC_ReplaceText(const struct FString& Replace, const struct FString& With, struct FString* Text);
	struct FString GetHumanReadableName();
	struct FString GetItemName(const struct FString& FullName);
	bool CalcCamera(float fDeltaTime, struct FVector* out_CamLoc, struct FRotator* out_CamRot, float* out_FOV);
	void EndViewTarget(class APlayerController* PC);
	void BecomeViewTarget(class APlayerController* PC);
	bool CheckForErrors();
	void DebugFreezeGame();
	float GetGravityZ();
	void CheckHitInfo(class UPrimitiveComponent* FallBackComponent, const struct FVector& Dir, struct FTraceHitInfo* HitInfo, struct FVector* out_HitLocation);
	void TakeRadiusDamage(class AController* InstigatedBy, float BaseDamage, float DamageRadius, class UClass* DamageType, float Momentum, const struct FVector& HurtOrigin, bool bFullDamage, class AActor* DamageCauser);
	bool HealDamage(int Amount, class AController* Healer, class UClass* DamageType);
	void TakeDamage(int DamageAmount, class AController* EventInstigator, const struct FVector& HitLocation, const struct FVector& Momentum, class UClass* DamageType, const struct FTraceHitInfo& HitInfo, class AActor* DamageCauser);
	void KilledBy(class APawn* EventInstigator);
	bool HurtRadius(float BaseDamage, float DamageRadius, class UClass* DamageType, float Momentum, const struct FVector& HurtOrigin, class AActor* IgnoredActor, class AController* InstigatedByController, bool bDoFullDamage);
	bool StopsProjectile(class AProjectile* P);
	void NotifySkelControlBeyondLimit(class USkelControlLookAt* LookAt);
	void ConstraintBrokenNotify(class AActor* ConOwner, class URB_ConstraintSetup* ConSetup, class URB_ConstraintInstance* ConInstance);
	void SetInitialState();
	void PostBeginPlay();
	void BroadcastLocalizedTeamMessage(int TeamIndex, class UClass* InMessageClass, int Switch, class APlayerReplicationInfo* RelatedPRI_2, class APlayerReplicationInfo* RelatedPRI_3, class UObject* OptionalObject);
	void BroadcastLocalizedMessage(class UClass* InMessageClass, int Switch, class APlayerReplicationInfo* RelatedPRI_2, class APlayerReplicationInfo* RelatedPRI_3, class UObject* OptionalObject);
	void PreBeginPlay();
	bool FindActorsOfClass(class UClass* ActorClass, TArray<class AActor*>* out_Actors);
	void LocalPlayerControllers(class UClass* BaseClass, class APlayerController** PC);
	void AllOwnedComponents(class UClass* BaseClass, class UActorComponent** OutComponent);
	void ComponentList(class UClass* BaseClass, class UActorComponent** out_Component);
	void OverlappingActors(class UClass* BaseClass, float Radius, const struct FVector& Loc, bool bIgnoreHidden, class AActor** out_Actor);
	void CollidingActors(class UClass* BaseClass, float Radius, const struct FVector& Loc, bool bUseOverlapCheck, class AActor** Actor);
	void VisibleCollidingActors(class UClass* BaseClass, float Radius, const struct FVector& Loc, bool bIgnoreHidden, class AActor** Actor);
	void VisibleActors(class UClass* BaseClass, float Radius, const struct FVector& Loc, class AActor** Actor);
	void TraceActors(class UClass* BaseClass, const struct FVector& End, const struct FVector& Start, const struct FVector& Extent, int ExtraTraceFlags, class AActor** Actor, struct FVector* HitLoc, struct FVector* HitNorm, struct FTraceHitInfo* HitInfo);
	void TouchingActors(class UClass* BaseClass, class AActor** Actor);
	void BasedActors(class UClass* BaseClass, class AActor** Actor);
	void ChildActors(class UClass* BaseClass, class AActor** Actor);
	void DynamicActors(class UClass* BaseClass, class AActor** Actor);
	void AllActors(class UClass* BaseClass, class AActor** Actor);
	struct FString GetURLMap();
	void PostTeleport(class ATeleporter* OutTeleporter);
	bool PreTeleport(class ATeleporter* InTeleporter);
	struct FVector GetDestination(class AController* C);
	bool SuggestTossVelocity(const struct FVector& Destination, const struct FVector& Start, float TossSpeed, float BaseTossZ, float DesiredZPct, const struct FVector& CollisionSize, float TerminalVelocity, struct FVector* TossVelocity);
	bool PlayerCanSeeMe();
	void MakeNoise(float Loudness, const struct FName& NoiseType);
	void PlaySound(class USoundCue* InSoundCue, bool bNotReplicated, bool bNoRepToOwner, bool bStopWhenOwnerDestroyed, const struct FVector& SoundLocation, bool bNoRepToRelevant, bool bPlayOnSelf);
	class UAudioComponent* CreateAudioComponent(class USoundCue* InSoundCue, bool bPlay, bool bStopWhenOwnerDestroyed, bool bUseLocation, const struct FVector& SourceLocation, bool bAttachToSelf);
	float GetTimerRate(const struct FName& TimerFuncName, class UObject* inObj);
	float GetTimerCount(const struct FName& inTimerFunc, class UObject* inObj);
	bool IsTimerActive(const struct FName& inTimerFunc, class UObject* inObj);
	void ClearTimer(const struct FName& inTimerFunc, class UObject* inObj);
	void SetTimer(float InRate, bool inbLoop, const struct FName& inTimerFunc, class UObject* inObj);
	void TornOff();
	bool Destroy();
	class AActor* Spawn(class UClass* SpawnClass, class AActor* SpawnOwner, const struct FName& SpawnTag, const struct FVector& SpawnLocation, const struct FRotator& SpawnRotation, class AActor* ActorTemplate, bool bNoCollisionFail);
	void GetBoundingCylinder(float* CollisionRadius, float* CollisionHeight);
	void GetComponentsBoundingBox(struct FBox* ActorBox);
	bool IsOverlapping(class AActor* A);
	bool ContainsPoint(const struct FVector& Spot);
	bool FindSpot(const struct FVector& BoxExtent, struct FVector* SpotLocation);
	bool FastTrace(const struct FVector& TraceEnd, const struct FVector& TraceStart, const struct FVector& BoxExtent, bool bTraceBullet);
	bool PointCheckComponent(class UPrimitiveComponent* InComponent, const struct FVector& PointLocation, const struct FVector& PointExtent);
	bool TraceComponent(class UPrimitiveComponent* InComponent, const struct FVector& TraceEnd, const struct FVector& TraceStart, const struct FVector& Extent, struct FVector* HitLocation, struct FVector* HitNormal, struct FTraceHitInfo* HitInfo);
	class AActor* Trace(const struct FVector& TraceEnd, const struct FVector& TraceStart, bool bTraceActors, const struct FVector& Extent, int ExtraTraceFlags, struct FVector* HitLocation, struct FVector* HitNormal, struct FTraceHitInfo* HitInfo);
	void OutsideWorldBounds();
	void FellOutOfWorld(class UClass* dmgType);
	void VolumeBasedDestroy(class APhysicsVolume* PV);
	bool UsedBy(class APawn* User);
	bool OverRotated(struct FRotator* out_Desired, struct FRotator* out_Actual);
	bool ClampRotation(const struct FRotator& rBase, const struct FRotator& rUpperLimits, const struct FRotator& rLowerLimits, struct FRotator* out_Rot);
	void RanInto(class AActor* Other);
	void EncroachedBy(class AActor* Other);
	bool EncroachingOn(class AActor* Other);
	void CollisionChanged();
	class AActor* SpecialHandling(class APawn* Other);
	void Detach(class AActor* Other);
	void Attach(class AActor* Other);
	void BaseChange();
	void Bump(class AActor* Other, class UPrimitiveComponent* OtherComp, const struct FVector& HitNormal);
	void UnTouch(class AActor* Other);
	void PostTouch(class AActor* Other);
	void Touch(class AActor* Other, class UPrimitiveComponent* OtherComp, const struct FVector& HitLocation, const struct FVector& HitNormal);
	void PhysicsVolumeChange(class APhysicsVolume* NewVolume);
	void Landed(const struct FVector& HitNormal, class AActor* FloorActor);
	void Falling();
	void HitWall(const struct FVector& HitNormal, class AActor* Wall, class UPrimitiveComponent* WallComp);
	void Timer();
	void Tick(float DeltaTime);
	void LostChild(class AActor* Other);
	void GainedChild(class AActor* Other);
	void Destroyed();
	void SetTickGroup(TEnumAsByte<ETickingGroup> NewTickGroup);
	void DetachComponent(class UActorComponent* ExComponent);
	void AttachComponent(class UActorComponent* NewComponent);
	void UnClock(float* Time);
	void Clock(float* Time);
	void SetPhysics(TEnumAsByte<EPhysics> newPhysics);
	void SetOnlyOwnerSee(bool bNewOnlyOwnerSee);
	void SetHidden(bool bNewHidden);
	void ChartData(const struct FString& DataName, float DataValue);
	void STATIC_DrawDebugArc(const struct FVector& Origin, const struct FVector& Up, const struct FVector& Forward, float Size, int Degrees, int ArcDegreesResolution, unsigned char R, unsigned char G, unsigned char B, bool bUseDistanceMarker, bool bPersistentLines);
	void STATIC_DrawDebugCone(const struct FVector& Origin, const struct FVector& Direction, float Length, float AngleWidth, float AngleHeight, int NumSides, const struct FColor& DrawColor, bool bPersistentLines);
	void STATIC_DrawDebugCylinder(const struct FVector& Start, const struct FVector& End, float Radius, int Segments, unsigned char R, unsigned char G, unsigned char B, bool bPersistentLines);
	void STATIC_DrawDebugSphereTime(const struct FVector& Center, float Radius, int Segments, unsigned char R, unsigned char G, unsigned char B, float timeToLive);
	void STATIC_DrawDebugSphere(const struct FVector& Center, float Radius, int Segments, unsigned char R, unsigned char G, unsigned char B, bool bPersistentLines);
	void STATIC_DrawDebugCoordinateSystem(const struct FVector& AxisLoc, const struct FRotator& AxisRot, float Scale, bool bPersistentLines);
	void STATIC_DrawDebugBox(const struct FVector& Center, const struct FVector& Extent, unsigned char R, unsigned char G, unsigned char B, bool bPersistentLines);
	void STATIC_DrawDebugBoxTime(const struct FVector& Center, const struct FVector& Extent, unsigned char R, unsigned char G, unsigned char B, float timeToLive);
	void STATIC_DrawDebugLineTime(const struct FVector& LineStart, const struct FVector& LineEnd, unsigned char R, unsigned char G, unsigned char B, float timeToLive);
	void STATIC_DrawDebugLine(const struct FVector& LineStart, const struct FVector& LineEnd, unsigned char R, unsigned char G, unsigned char B, bool bPersistentLines);
	void STATIC_FlushPersistentDebugLines();
	void SetForcedInitialReplicatedProperty(class UProperty* PropToReplicate, bool bAdd);
	void ReplicatedEvent(const struct FName& VarName);
	bool IsOwnedBy(class AActor* TestActor);
	class AActor* GetBaseMost();
	bool IsBasedOn(class AActor* TestActor);
	void FindBase();
	void SetOwner(class AActor* NewOwner);
	void SetBase(class AActor* NewBase, const struct FVector& NewFloor, class USkeletalMeshComponent* SkelComp, const struct FName& AttachName);
	float GetTerminalVelocity();
	void AutonomousPhysics(float DeltaSeconds);
	bool MoveSmooth(const struct FVector& Delta);
	void SetHardAttach(bool bNewHardAttach);
	bool SetRelativeLocation(const struct FVector& NewLocation);
	bool SetRelativeRotation(const struct FRotator& NewRotation);
	void SetZone(bool bForceRefresh);
	TEnumAsByte<EMoveDir> MovingWhichWay(float* Amount);
	bool SetRotation(const struct FRotator& NewRotation);
	bool SetLocation(const struct FVector& NewLocation);
	bool Move(const struct FVector& Delta);
	void SetDrawScale3D(const struct FVector& NewScale3D);
	void SetDrawScale(float NewScale);
	void SetCollisionType(TEnumAsByte<ECollisionType> NewCollisionType);
	void SetCollisionSize(float NewRadius, float NewHeight);
	void SetCollision(bool bNewColActors, bool bNewBlockActors, bool bNewIgnoreEncroachers);
	void FinishAnim(class UAnimNodeSequence* SeqNode);
	void Sleep(float Seconds);
	struct FString ConsoleCommand(const struct FString& Command, bool bWriteToLog);
	void ForceUpdateComponents(bool bCollisionUpdate, bool bTransformOnly);
};


// Class Engine.NavigationPoint
// 0x0154 (0x0314 - 0x01C0)
class ANavigationPoint : public AActor
{
public:
	unsigned long                                      bEndPoint : 1;                                            // 0x01C0(0x0004) (Transient)
	unsigned long                                      bTransientEndPoint : 1;                                   // 0x01C0(0x0004) (Transient)
	unsigned long                                      bHideEditorPaths : 1;                                     // 0x01C0(0x0004) (Transient)
	unsigned long                                      bCanReach : 1;                                            // 0x01C0(0x0004) (Transient)
	unsigned long                                      bBlocked : 1;                                             // 0x01C0(0x0004) (Edit)
	unsigned long                                      bOneWayPath : 1;                                          // 0x01C0(0x0004) (Edit)
	unsigned long                                      bNeverUseStrafing : 1;                                    // 0x01C0(0x0004)
	unsigned long                                      bAlwaysUseStrafing : 1;                                   // 0x01C0(0x0004)
	unsigned long                                      bForceNoStrafing : 1;                                     // 0x01C0(0x0004) (Const)
	unsigned long                                      bAutoBuilt : 1;                                           // 0x01C0(0x0004) (Const)
	unsigned long                                      bSpecialMove : 1;                                         // 0x01C0(0x0004)
	unsigned long                                      bNoAutoConnect : 1;                                       // 0x01C0(0x0004)
	unsigned long                                      bNotBased : 1;                                            // 0x01C0(0x0004) (Const)
	unsigned long                                      bPathsChanged : 1;                                        // 0x01C0(0x0004) (Const)
	unsigned long                                      bDestinationOnly : 1;                                     // 0x01C0(0x0004)
	unsigned long                                      bSourceOnly : 1;                                          // 0x01C0(0x0004)
	unsigned long                                      bSpecialForced : 1;                                       // 0x01C0(0x0004)
	unsigned long                                      bMustBeReachable : 1;                                     // 0x01C0(0x0004)
	unsigned long                                      bBlockable : 1;                                           // 0x01C0(0x0004)
	unsigned long                                      bFlyingPreferred : 1;                                     // 0x01C0(0x0004)
	unsigned long                                      bMayCausePain : 1;                                        // 0x01C0(0x0004)
	unsigned long                                      bAlreadyVisited : 1;                                      // 0x01C0(0x0004) (Transient)
	unsigned long                                      bVehicleDestination : 1;                                  // 0x01C0(0x0004) (Edit)
	unsigned long                                      bMakeSourceOnly : 1;                                      // 0x01C0(0x0004) (Edit)
	unsigned long                                      bMustTouchToReach : 1;                                    // 0x01C0(0x0004)
	unsigned long                                      bCanWalkOnToReach : 1;                                    // 0x01C0(0x0004)
	unsigned long                                      bBuildLongPaths : 1;                                      // 0x01C0(0x0004)
	unsigned long                                      bBlockedForVehicles : 1;                                  // 0x01C0(0x0004) (Edit)
	unsigned long                                      bPreferredVehiclePath : 1;                                // 0x01C0(0x0004) (Edit)
	unsigned long                                      bIsSkippable : 1;                                         // 0x01C0(0x0004)
	unsigned long                                      bNeedsVelocityToTrigger : 1;                              // 0x01C0(0x0004)
	unsigned long                                      bIsSpecialMove : 1;                                       // 0x01C0(0x0004)
	unsigned long                                      bCanBePlayerNavigationPoint : 1;                          // 0x01C4(0x0004)
	unsigned long                                      bHasCrossLevelPaths : 1;                                  // 0x01C4(0x0004) (Const)
	struct FNavigationOctreeObject                     NavOctreeObject;                                          // 0x01C8(0x0034) (Const, Native, Transient)
	TArray<class UReachSpec*>                          PathList;                                                 // 0x01FC(0x000C) (Edit, Const, EditConst, DuplicateTransient, NeedCtorLink, EditInline)
	TArray<struct FNavReference>                       EditorProscribedPaths;                                    // 0x0208(0x000C) (DuplicateTransient, NeedCtorLink)
	TArray<struct FNavReference>                       EditorForcedPaths;                                        // 0x0214(0x000C) (DuplicateTransient, NeedCtorLink)
	TArray<class AVolume*>                             VolumeList;                                               // 0x0220(0x000C) (Edit, Const, EditConst, NeedCtorLink)
	int                                                visitedWeight;                                            // 0x022C(0x0004)
	int                                                bestPathWeight;                                           // 0x0230(0x0004) (Const)
	class ANavigationPoint*                            nextNavigationPoint;                                      // 0x0234(0x0004) (Const)
	class ANavigationPoint*                            nextOrdered;                                              // 0x0238(0x0004) (Const)
	class ANavigationPoint*                            prevOrdered;                                              // 0x023C(0x0004) (Const)
	class ANavigationPoint*                            previousPath;                                             // 0x0240(0x0004) (Const)
	int                                                Cost;                                                     // 0x0244(0x0004)
	int                                                ExtraCost;                                                // 0x0248(0x0004) (Edit)
	int                                                TransientCost;                                            // 0x024C(0x0004) (Transient)
	int                                                FearCost;                                                 // 0x0250(0x0004) (Transient)
	unsigned char                                      UnknownData00[0x3C];                                      // 0x0254(0x003C) UNKNOWN PROPERTY: MapProperty Engine.NavigationPoint.CostArray
	class ADroppedPickup*                              InventoryCache;                                           // 0x0290(0x0004)
	float                                              InventoryDist;                                            // 0x0294(0x0004)
	float                                              LastDetourWeight;                                         // 0x0298(0x0004) (Const)
	class UCylinderComponent*                          CylinderComponent;                                        // 0x029C(0x0004) (ExportObject, Component, EditInline)
	class AObjective*                                  NearestObjective;                                         // 0x02A0(0x0004)
	float                                              ObjectiveDistance;                                        // 0x02A4(0x0004)
	struct FCylinder                                   MaxPathSize;                                              // 0x02A8(0x0008) (Edit, Const, EditConst)
	struct FGuid                                       NavGuid;                                                  // 0x02B0(0x0010) (Edit, Const, EditConst, DuplicateTransient)
	class USpriteComponent*                            GoodSprite;                                               // 0x02C0(0x0004) (Const, ExportObject, Component, EditInline)
	class USpriteComponent*                            BadSprite;                                                // 0x02C4(0x0004) (Const, ExportObject, Component, EditInline)
	int                                                NetworkID;                                                // 0x02C8(0x0004) (Edit, Const, EditConst)
	class APawn*                                       AnchoredPawn;                                             // 0x02CC(0x0004) (Transient)
	float                                              LastAnchoredPawnTime;                                     // 0x02D0(0x0004) (Transient)
	struct FString                                     Abbrev;                                                   // 0x02D4(0x000C) (NeedCtorLink)
	float                                              IgnoreAsTaserSpotTimeStamp;                               // 0x02E0(0x0004)
	TArray<class ANavigationPoint*>                    CanSeeMePoints;                                           // 0x02E4(0x000C) (Edit, NeedCtorLink)
	TArray<class ANavigationPoint*>                    VisiblePoints;                                            // 0x02F0(0x000C) (Edit, NeedCtorLink)
	int                                                Visibility;                                               // 0x02FC(0x0004) (Edit)
	int                                                Exposure;                                                 // 0x0300(0x0004) (Edit)
	int                                                UsageCount;                                               // 0x0304(0x0004) (Transient)
	TArray<class AController*>                         Users;                                                    // 0x0308(0x000C) (Transient, NeedCtorLink)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.NavigationPoint");
		return ptr;
	}


	bool OnMatchingNetworks(class ANavigationPoint* Nav);
	void OnToggle(class USeqAct_Toggle* inAction);
	bool STATIC_GetAllNavInRadius(class AActor* chkActor, const struct FVector& ChkPoint, float Radius, bool bSkipBlocked, int inNetworkID, const struct FCylinder& MinSize, TArray<class ANavigationPoint*>* out_NavList);
	class ANavigationPoint* STATIC_GetNearestNavToPoint(class AActor* chkActor, const struct FVector& ChkPoint, class UClass* RequiredClass, TArray<class ANavigationPoint*> ExcludeList);
	class ANavigationPoint* STATIC_GetNearestNavToActor(class AActor* chkActor, class UClass* RequiredClass, TArray<class ANavigationPoint*> ExcludeList, float MinDist);
	bool IsAvailableTo(class AActor* chkActor);
	bool ProceedWithMove(class APawn* Other);
	bool SuggestMovePreparation(class APawn* Other);
	float DetourWeight(class APawn* Other, float PathWeight);
	bool Accept(class AActor* Incoming, class AActor* Source);
	int SpecialCost(class APawn* Seeker, class UReachSpec* Path);
	bool CanTeleport(class AActor* A);
	class UReachSpec* GetReachSpecTo(class ANavigationPoint* Nav);
	void GetBoundingCylinder(float* CollisionRadius, float* CollisionHeight);
	bool CanSee(class ANavigationPoint* Other);
	bool SeenFrom(class ANavigationPoint* Other);
	bool CanBeSeenFrom(const struct FVector& Offset, class ANavigationPoint* Other, const struct FVector& otherOffset);
	bool HasVisibilityTo(const struct FVector& Offset, class ANavigationPoint* Other, const struct FVector& otherOffset);
	void Unoccupy(class AController* OldUser);
	void Occupy(class AController* NewUser);
	int Usage();
};


// Class Engine.PathNode
// 0x0000 (0x0314 - 0x0314)
class APathNode : public ANavigationPoint
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.PathNode");
		return ptr;
	}

};


// Class Engine.CoverLink
// 0x0094 (0x03A8 - 0x0314)
class ACoverLink : public ANavigationPoint
{
public:
	TArray<struct FCoverSlot>                          Slots;                                                    // 0x0314(0x000C) (Edit, NeedCtorLink, EditInline)
	TArray<class AController*>                         Claims;                                                   // 0x0320(0x000C) (NeedCtorLink)
	unsigned long                                      bDisabled : 1;                                            // 0x032C(0x0004) (Edit)
	unsigned long                                      bClaimAllSlots : 1;                                       // 0x032C(0x0004) (Edit)
	unsigned long                                      bAutoSort : 1;                                            // 0x032C(0x0004)
	unsigned long                                      bAutoAdjust : 1;                                          // 0x032C(0x0004) (Edit)
	unsigned long                                      bForceCoverActions : 1;                                   // 0x032C(0x0004) (Edit)
	unsigned long                                      bCircular : 1;                                            // 0x032C(0x0004)
	unsigned long                                      bLooped : 1;                                              // 0x032C(0x0004)
	unsigned long                                      bPlayerOnly : 1;                                          // 0x032C(0x0004)
	unsigned long                                      bDynamicCover : 1;                                        // 0x032C(0x0004)
	unsigned long                                      bInvalidCover : 1;                                        // 0x032C(0x0004) (Transient)
	unsigned long                                      bDebug_FireLinks : 1;                                     // 0x032C(0x0004) (Edit)
	unsigned long                                      bDebug_ExposedLinks : 1;                                  // 0x032C(0x0004) (Edit)
	unsigned long                                      bDebug_DangerLinks : 1;                                   // 0x032C(0x0004) (Edit)
	float                                              MaxFireLinkDist;                                          // 0x0330(0x0004)
	struct FVector                                     CircularOrigin;                                           // 0x0334(0x000C) (Const)
	float                                              CircularRadius;                                           // 0x0340(0x0004) (Const)
	float                                              AlignDist;                                                // 0x0344(0x0004) (Const)
	float                                              StandHeight;                                              // 0x0348(0x0004) (Const)
	float                                              MidHeight;                                                // 0x034C(0x0004) (Const)
	float                                              LowHeight;                                                // 0x0350(0x0004) (Const)
	struct FCoverRange                                 LowCover;                                                 // 0x0354(0x0008) (Const)
	struct FCoverRange                                 MediumCover;                                              // 0x035C(0x0008) (Const)
	int                                                SideOffsetTraceHeight;                                    // 0x0364(0x0004) (Const)
	float                                              IvalidUntilThisTime;                                      // 0x0368(0x0004) (Transient)
	float                                              CornerDist;                                               // 0x036C(0x0004) (Const)
	float                                              FireFromCornerDist;                                       // 0x0370(0x0004) (Const)
	struct FVector                                     StandingLeanOffset;                                       // 0x0374(0x000C) (Const)
	struct FVector                                     CrouchLeanOffset;                                         // 0x0380(0x000C) (Const)
	struct FVector                                     PopupOffset;                                              // 0x038C(0x000C) (Const)
	float                                              SlipDist;                                                 // 0x0398(0x0004) (Const)
	float                                              TurnDist;                                                 // 0x039C(0x0004) (Const)
	float                                              DangerScale;                                              // 0x03A0(0x0004)
	class ACoverLink*                                  NextCoverLink;                                            // 0x03A4(0x0004) (Const)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.CoverLink");
		return ptr;
	}


	struct FString GetDebugString(int SlotIdx);
	int AddCoverSlot(const struct FVector& SlotLocation, const struct FRotator& SlotRotation, int SlotIdx, bool bForceSlotUpdate);
	bool GetSwatTurnTarget(int SlotIdx, int Direction, struct FCoverReference* out_Info);
	void OnToggle(class USeqAct_Toggle* inAction);
	bool IsEnabled();
	bool AutoAdjustSlot(int SlotIdx, bool bOnlyCheckLeans);
	void OnModifyCover(class USeqAct_ModifyCover* Action);
	void SetSlotEnabled(int SlotIdx, bool bEnable);
	void SetDisabled(bool bNewDisabled);
	void GetSlotActions(int SlotIdx, TArray<TEnumAsByte<ECoverAction>>* Actions);
	bool HasFireLinkTo(int SlotIdx, const struct FCoverInfo& ChkCover, bool bAllowFallbackLinks);
	bool GetFireLinkTo(int SlotIdx, const struct FCoverInfo& ChkCover, TEnumAsByte<ECoverAction> ChkAction, TEnumAsByte<ECoverType> ChkType, int* out_FireLinkIdx, TArray<int>* out_Items);
	bool AllowLeftTransition(int SlotIdx);
	bool AllowRightTransition(int SlotIdx);
	bool IsRightEdgeSlot(int SlotIdx, bool bIgnoreLeans);
	bool IsLeftEdgeSlot(int SlotIdx, bool bIgnoreLeans);
	bool IsEdgeSlot(int SlotIdx, bool bIgnoreLeans);
	bool FindSlots(const struct FVector& CheckLocation, float MaxDistance, int* LeftSlotIdx, int* RightSlotIdx);
	bool IsStationarySlot(int SlotIdx);
	bool IsValidClaim(class AController* ChkClaim, int SlotIdx, bool bSkipTeamCheck, bool bSkipOverlapCheck);
	bool UnClaim(class AController* OldClaim, int SlotIdx, bool bUnclaimAll);
	bool Claim(class AController* NewClaim, int SlotIdx);
	bool IsExposedTo(int SlotIdx, const struct FCoverInfo& ChkSlot, float* out_ExposedScale);
	struct FVector GetSlotFireLocation(int SlotIdx, TEnumAsByte<ECoverAction> Action);
	class ACoverSlotMarker* GetSlotMarker(int SlotIdx);
	struct FVector GetSlotViewPoint(int SlotIdx, TEnumAsByte<ECoverType> Type, TEnumAsByte<ECoverAction> Action);
	struct FRotator GetSlotRotation(int SlotIdx, bool bForceUseOffset);
	struct FVector GetSlotLocation(int SlotIdx, bool bForceUseOffset);
};


// Class Engine.CoverSlotMarker
// 0x0008 (0x031C - 0x0314)
class ACoverSlotMarker : public ANavigationPoint
{
public:
	struct FCoverInfo                                  OwningSlot;                                               // 0x0314(0x0008) (Edit, EditConst)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Engine.CoverSlotMarker");
		return ptr;
	}


	bool IsValidClaim(class AController* ChkClaim, bool bSkipTeamCheck, bool bSkipOverlapCheck);
	struct FRotator GetSlotRotation();
	struct FVector GetSlotLocation();
	void PostBeginPlay();
};


// Class Engine.Engine
// 0x036C (0x03AC - 0x0040)
class UEngine : public USubsystem
{
public:
	class UFont*                                       TinyFont;                                                 // 0x0040(0x0004)
	struct FString                                     TinyFontName;                                             // 0x0044(0x000C) (Config, GlobalConfig, NeedCtorLink)
	class UFont*                                       SmallFont;                                                // 0x0050(0x0004)
	struct FString                                     SmallFontName;                                            // 0x0054(0x000C) (Config, GlobalConfig, NeedCtorLink)
	class UFont*                                       MediumFont;                                               // 0x0060(0x0004)
	struct FString                                     MediumFontName;                                           // 0x0064(0x000C) (Config, GlobalConfig, NeedCtorLink)
